[
    {
        "id": 159,
        "name": "sand-force",
        "effect_changes": [],
        "effect_entries": [
            {
                "effect": "During a sandstorm, this Pokémon's rock-, ground-, and steel-type moves have 1.3× their base power.  This Pokémon does not take sandstorm damage, regardless of type.",
                "short_effect": "Strengthens rock, ground, and steel moves to 1.3× their power during a sandstorm.  Protects against sandstorm damage."
            }
        ]
    },
    {
        "id": 114,
        "name": "storm-drain",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "Redirects water moves without negating them or granting any Special Attack boost.  Does not redirect hidden power.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "black-white",
                    "url": "https://pokeapi.co/api/v2/version-group/11/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "All other Pokémon's single-target water-type moves are redirected to this Pokémon, if it is an eligible target.  Other Pokémon's Water moves raise this Pokémon's Special Attack one stage, negating any other effect on it, and cannot miss it.\n\nIf the move's intended target also has this ability, the move is not redirected.  When multiple Pokémon with this ability are possible targets for redirection, the move is redirected to the one with the highest Speed stat, or, in the case of a tie, to a random tied Pokémon.  follow me takes precedence over this ability.",
                "short_effect": "Redirects single-target water moves to this Pokémon where possible.  Absorbs Water moves, raising Special Attack one stage."
            }
        ]
    },
    {
        "id": 60,
        "name": "sticky-hold",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "Has no overworld effect.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "emerald",
                    "url": "https://pokeapi.co/api/v2/version-group/6/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "This Pokémon's hold item cannot be removed by other Pokémon.\n\nDamaging moves that would remove this Pokémon's item can still inflict damage against this Pokémon, e.g. knock off or pluck.  This Pokémon can still use moves that involve the loss of its own item, e.g. fling or trick.\n\nOverworld: If the lead Pokémon has this ability, the encounter rate while fishing is increased.",
                "short_effect": "Prevents a held item from being removed by other Pokémon."
            }
        ]
    }
]