[
    {
        "id": 119,
        "name": "frisk",
        "effect_changes": [],
        "effect_entries": [
            {
                "effect": "When this Pokémon enters battle, it reveals an opposing Pokémon's held item to all participating trainers.\n\nIn a double battle, if one opponent has an item, this Pokémon will Frisk that Pokémon; if both have an item, it will Frisk one at random.",
                "short_effect": "Reveals an opponent's held item upon entering battle."
            }
        ]
    },
    {
        "id": 46,
        "name": "pressure",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "Has no overworld effect.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "emerald",
                    "url": "https://pokeapi.co/api/v2/version-group/6/"
                }
            },
            {
                "effect_entries": [
                    {
                        "effect": "Does not affect friendly Pokémon's moves that target all other Pokémon.  This ability's presence is not announced upon entering battle.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "diamond-pearl",
                    "url": "https://pokeapi.co/api/v2/version-group/8/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "Moves targetting this Pokémon use one extra PP.\n\nThis ability stacks if multiple targets have it.  This ability still affects moves that fail or miss.  This ability does not affect ally moves that target either the entire field or just its side, nor this Pokémon's self-targetted moves; it does, however, affect single-targetted ally moves aimed at this Pokémon, ally moves that target all other Pokémon, and opponents' moves that target the entire field.  If this ability raises a move's PP cost above its remaining PP, it will use all remaining PP.\n\nWhen this Pokémon enters battle, all participating trainers are notified that it has this ability.\n\nOverworld: If the lead Pokémon has this ability, higher-levelled Pokémon have their encounter rate increased.",
                "short_effect": "Increases the PP cost of moves targetting the Pokémon by one."
            }
        ]
    }
]