[
    {
        "id": 50,
        "name": "run-away",
        "effect_changes": [],
        "effect_entries": [
            {
                "effect": "This Pokémon is always successful fleeing from wild battles, even if trapped by a move or ability.",
                "short_effect": "Ensures success fleeing from wild battles."
            }
        ]
    },
    {
        "id": 53,
        "name": "pickup",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "Has no effect in battle.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "black-white",
                    "url": "https://pokeapi.co/api/v2/version-group/11/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "At the end of each turn, if another Pokémon consumed or Flung a held item that turn, this Pokémon picks up the item if it is not already holding one.  After each battle, this Pokémon has a 10% chance of picking up an item if it is not already holding one.\n\nThe air balloon and eject button cannot be picked up.\n\nThe items that may be found vary by game, and, since Pokémon Emerald, by the Pokémon's level.  This ability is checked after the battle ends, at which point any temporary ability changes have worn off.",
                "short_effect": "Picks up other Pokémon's used and Flung held items.  May also pick up an item after battle."
            }
        ]
    },
    {
        "id": 72,
        "name": "vital-spirit",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "Has no overworld effect.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "emerald",
                    "url": "https://pokeapi.co/api/v2/version-group/6/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "This Pokémon cannot be asleep.\n\nThis causes rest to fail altogether.  If a Pokémon is asleep and acquires this ability, it will immediately wake up; this includes when regaining a lost ability upon leaving battle.\n\nThis ability functions identically to insomnia in battle.\n\nOverworld: If the lead Pokémon has this ability, higher-levelled Pokémon have their encounter rate increased.",
                "short_effect": "Prevents sleep."
            }
        ]
    }
]