[
    {
        "id": 103,
        "name": "klutz",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "fling can be used as usual.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "black-white",
                    "url": "https://pokeapi.co/api/v2/version-group/11/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "In battle, this Pokémon cannot use its held item, nor will the item have any passive effect on the battle, positive or negative.  This Pokémon also cannot use fling.\n\nThe Speed cut from the iron ball and the effort items (the macho brace, power weight, power bracer, power belt, power lens, power band, and power anklet) is unaffected.  Items that do not directly affect the battle, such as the exp share, the amulet coin, or the soothe bell, work as usual.  All held items work as usual out of battle.\n\nOther moves that use the held item, such as natural gift and switcheroo, work as usual.",
                "short_effect": "Prevents the Pokémon from using its held item in battle."
            }
        ]
    },
    {
        "id": 144,
        "name": "regenerator",
        "effect_changes": [],
        "effect_entries": [
            {
                "effect": "This Pokémon regains 1/3 of its maximum HP when it is switched out for another Pokémon under any circumstances other than having fainted.\n\nThis ability does not take effect when a battle ends.",
                "short_effect": "Heals for 1/3 max HP upon switching out."
            }
        ]
    },
    {
        "id": 131,
        "name": "healer",
        "effect_changes": [],
        "effect_entries": [
            {
                "effect": "Friendly Pokémon next to this Pokémon in double and triple battles each have a 30% chance of being cured of any major status ailment after each turn.",
                "short_effect": "Has a 30% chance of curing each adjacent ally of any major status ailment after each turn."
            }
        ]
    }
]