[
    {
        "id": 56,
        "name": "cute-charm",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "Has no overworld effect.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "emerald",
                    "url": "https://pokeapi.co/api/v2/version-group/6/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "Whenever a move makes contact with this Pokémon, the move's user has a 30% chance of being infatuated.\n\nOverworld: If the first Pokémon in the party has this ability, any wild Pokémon whose species can be either gender has a 2/3 chance of being set to the opposite gender, and a 1/3 chance of having a random gender as usual.",
                "short_effect": "Has a 30% chance of infatuating attacking Pokémon on contact."
            }
        ]
    },
    {
        "id": 103,
        "name": "klutz",
        "effect_changes": [
            {
                "effect_entries": [
                    {
                        "effect": "fling can be used as usual.",
                        "language": {
                            "name": "en",
                            "url": "https://pokeapi.co/api/v2/language/9/"
                        }
                    }
                ],
                "version_group": {
                    "name": "black-white",
                    "url": "https://pokeapi.co/api/v2/version-group/11/"
                }
            }
        ],
        "effect_entries": [
            {
                "effect": "In battle, this Pokémon cannot use its held item, nor will the item have any passive effect on the battle, positive or negative.  This Pokémon also cannot use fling.\n\nThe Speed cut from the iron ball and the effort items (the macho brace, power weight, power bracer, power belt, power lens, power band, and power anklet) is unaffected.  Items that do not directly affect the battle, such as the exp share, the amulet coin, or the soothe bell, work as usual.  All held items work as usual out of battle.\n\nOther moves that use the held item, such as natural gift and switcheroo, work as usual.",
                "short_effect": "Prevents the Pokémon from using its held item in battle."
            }
        ]
    },
    {
        "id": 218,
        "name": "fluffy",
        "effect_changes": [],
        "effect_entries": [
            {
                "effect": "Damage from contact moves is halved.  Damage from Fire moves is doubled.",
                "short_effect": "Damage from contact moves is halved.  Damage from Fire moves is doubled."
            }
        ]
    }
]